tests/fixtures/expense.json

{
    "id": 201,
    "custom_id": null,
    "number": "N20180307",
    "original_number": "",
    "variable_symbol": "1234",
    "supplier_name": "Apple Czech s.r.o.",
    "supplier_street": "Klimentská 1216/46",
    "supplier_city": "Praha",
    "supplier_zip": "11000",
    "supplier_country": "CZ",
    "supplier_registration_no": "28897501",
    "supplier_vat_no": "CZ28897501",
    "subject_id": 36,
    "status": "paid",
    "document_type": "invoice",
    "issued_on": "2018-03-22",
    "taxable_fulfillment_due": "2018-03-22",
    "received_on": "2018-03-22",
    "due_on": null,
    "paid_on": "2018-03-22",
    "description": null,
    "private_note": null,
    "tags": [],
    "bank_account": "123456789/0300",
    "iban": null,
    "swift_bic": null,
    "payment_method": "bank",
    "currency": "CZK",
    "exchange_rate": "1.0",
    "transferred_tax_liability": false,
    "vat_price_mode": "without_vat",
    "supply_code": "",
    "subtotal": "100.0",
    "total": "121.0",
    "native_subtotal": "100.0",
    "native_total": "121.0",
    "paid_amount": "121.0",
    "lines": [
        {
            "id": 524,
            "name": "Test",
            "quantity": "1.0",
            "unit_name": "",
            "unit_price": "100.0",
            "vat_rate": 21,
            "unit_price_without_vat": "100.0",
            "unit_price_with_vat": "121.0"
        }
    ],
    "attachment": null,
    "html_url": "http://app.fakturoid.test/bigtest/expenses/201",
    "url": "http://app.fakturoid.test/api/v2/accounts/bigtest/expenses/201.json",
    "subject_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/subjects/36.json",
    "created_at": "2018-03-22T10:46:26.118+01:00",
    "updated_at": "2018-03-22T10:48:46.896+01:00"
}
