tests/fixtures/expenses.json

[
    {
        "id": 201,
        "custom_id": null,
        "number": "N20180307",
        "original_number": "",
        "variable_symbol": "1234",
        "supplier_name": "Apple Czech s.r.o.",
        "supplier_street": "Klimentská 1216/46",
        "supplier_city": "Praha",
        "supplier_zip": "11000",
        "supplier_country": "CZ",
        "supplier_registration_no": "28897501",
        "supplier_vat_no": "CZ28897501",
        "subject_id": 36,
        "status": "paid",
        "document_type": "invoice",
        "issued_on": "2018-03-22",
        "taxable_fulfillment_due": "2018-03-22",
        "received_on": "2018-03-22",
        "due_on": null,
        "paid_on": "2018-03-22",
        "description": null,
        "private_note": null,
        "tags": [],
        "bank_account": "123456789/0300",
        "iban": null,
        "swift_bic": null,
        "payment_method": "bank",
        "currency": "CZK",
        "exchange_rate": "1.0",
        "transferred_tax_liability": false,
        "vat_price_mode": "without_vat",
        "supply_code": "",
        "subtotal": "100.0",
        "total": "121.0",
        "native_subtotal": "100.0",
        "native_total": "121.0",
        "paid_amount": "121.0",
        "lines": [
            {
                "id": 524,
                "name": "Test",
                "quantity": "1.0",
                "unit_name": "",
                "unit_price": "100.0",
                "vat_rate": 21,
                "unit_price_without_vat": "100.0",
                "unit_price_with_vat": "121.0"
            }
        ],
        "attachment": null,
        "html_url": "http://app.fakturoid.test/bigtest/expenses/201",
        "url": "http://app.fakturoid.test/api/v2/accounts/bigtest/expenses/201.json",
        "subject_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/subjects/36.json",
        "created_at": "2018-03-22T10:46:26.118+01:00",
        "updated_at": "2018-03-22T10:48:46.896+01:00"
    },
    {
        "id": 161,
        "custom_id": null,
        "number": "N20180304",
        "original_number": null,
        "variable_symbol": null,
        "supplier_name": "Google Czech Republic, s.r.o.",
        "supplier_street": "Klimentská 1216/46",
        "supplier_city": "Praha",
        "supplier_zip": "11000",
        "supplier_country": "CZ",
        "supplier_registration_no": "27604977",
        "supplier_vat_no": "CZ27604977",
        "subject_id": 26,
        "status": "open",
        "document_type": "invoice",
        "issued_on": "2018-03-18",
        "taxable_fulfillment_due": "2018-03-18",
        "received_on": "2018-03-18",
        "due_on": "2018-04-01",
        "paid_on": null,
        "description": null,
        "private_note": null,
        "tags": [
            "Aplikace",
            "Majetek",
            "Vývoj"
        ],
        "bank_account": "123456-1234567890/0100",
        "iban": null,
        "swift_bic": null,
        "payment_method": "bank",
        "currency": "CZK",
        "exchange_rate": "1.0",
        "transferred_tax_liability": false,
        "vat_price_mode": "without_vat",
        "supply_code": null,
        "subtotal": "68800.0",
        "total": "81448.0",
        "native_subtotal": "68800.0",
        "native_total": "81448.0",
        "paid_amount": "0.0",
        "lines": [
            {
                "id": 411,
                "name": "Školení personálu",
                "quantity": "4.0",
                "unit_name": "lidi",
                "unit_price": "7000.0",
                "vat_rate": 21,
                "unit_price_without_vat": "7000.0",
                "unit_price_with_vat": "8470.0"
            },
            {
                "id": 412,
                "name": "Kalkulačka",
                "quantity": "1.0",
                "unit_name": null,
                "unit_price": "800.0",
                "vat_rate": 21,
                "unit_price_without_vat": "800.0",
                "unit_price_with_vat": "968.0"
            },
            {
                "id": 413,
                "name": "Grafická karta",
                "quantity": "1.0",
                "unit_name": null,
                "unit_price": "10000.0",
                "vat_rate": 21,
                "unit_price_without_vat": "10000.0",
                "unit_price_with_vat": "12100.0"
            },
            {
                "id": 414,
                "name": "Oprava",
                "quantity": "2.0",
                "unit_name": "PC",
                "unit_price": "15000.0",
                "vat_rate": 15,
                "unit_price_without_vat": "15000.0",
                "unit_price_with_vat": "17250.0"
            }
        ],
        "attachment": null,
        "html_url": "http://app.fakturoid.test/bigtest/expenses/161",
        "url": "http://app.fakturoid.test/api/v2/accounts/bigtest/expenses/161.json",
        "subject_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/subjects/26.json",
        "created_at": "2018-03-19T16:17:38.170+01:00",
        "updated_at": "2018-03-19T16:17:38.170+01:00"
    }
]
