tests/fixtures/invoice.json

{
    "id": 86,
    "custom_id": null,
    "proforma": false,
    "partial_proforma": null,
    "number": "2018-0051",
    "variable_symbol": "20180051",
    "your_name": "Bořivoj Hejsek",
    "your_street": "Hopsinkova 28",
    "your_street2": null,
    "your_city": "Praha",
    "your_zip": "10000",
    "your_country": "CZ",
    "your_registration_no": "87654321",
    "your_vat_no": "CZ1212121218",
    "your_local_vat_no": null,
    "client_name": "Apple Czech s.r.o.",
    "client_street": "Klimentská 1216/46",
    "client_street2": null,
    "client_city": "Praha",
    "client_zip": "11000",
    "client_country": "CZ",
    "client_registration_no": "28897501",
    "client_vat_no": "CZ28897501",
    "client_local_vat_no": null,
    "subject_id": 36,
    "subject_custom_id": null,
    "generator_id": null,
    "related_id": null,
    "correction": false,
    "correction_id": null,
    "paypal": false,
    "gopay": false,
    "token": "GRKWlRPoVw",
    "status": "open",
    "order_number": null,
    "issued_on": "2018-03-17",
    "taxable_fulfillment_due": "2018-03-17",
    "due": 14,
    "due_on": "2018-03-31",
    "sent_at": null,
    "paid_at": null,
    "reminder_sent_at": null,
    "accepted_at": null,
    "cancelled_at": null,
    "webinvoice_seen_at": null,
    "note": "Fakturujeme Vám následující položky",
    "footer_note": "",
    "private_note": null,
    "tags": [],
    "bank_account": "1234/1234",
    "iban": null,
    "swift_bic": null,
    "payment_method": "bank",
    "currency": "CZK",
    "exchange_rate": "1.0",
    "language": "de",
    "transferred_tax_liability": false,
    "eu_electronic_service": false,
    "vat_price_mode": "without_vat",
    "supply_code": null,
    "subtotal": "10000.0",
    "total": "12100.0",
    "native_subtotal": "10000.0",
    "native_total": "12100.0",
    "remaining_amount": "12100.0",
    "remaining_native_amount": "12100.0",
    "paid_amount": "0.0",
    "eet": false,
    "eet_cash_register": null,
    "eet_store": null,
    "eet_records": [],
    "lines": [
        {
            "id": 191,
            "name": "Magic mouse",
            "quantity": "5.0",
            "unit_name": "myš",
            "unit_price": "2000.0",
            "vat_rate": 21,
            "unit_price_without_vat": "2000.0",
            "unit_price_with_vat": "2420.0"
        }
    ],
    "html_url": "http://app.fakturoid.test/bigtest/invoices/86",
    "public_html_url": "http://app.fakturoid.test/bigtest/p/GRKWlRPoVw/2018-0051",
    "url": "http://app.fakturoid.test/api/v2/accounts/bigtest/invoices/86.json",
    "pdf_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/invoices/86/download.pdf",
    "subject_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/subjects/36.json",
    "created_at": "2018-03-19T16:17:01.536+01:00",
    "updated_at": "2018-03-19T16:17:01.536+01:00"
}
