tests/fixtures/search_invoices.json

[
    {
        "id": 1049,
        "custom_id": null,
        "proforma": false,
        "partial_proforma": false,
        "number": "2018-1006",
        "variable_symbol": "120180003",
        "your_name": "Bořivoj Hejsek",
        "your_street": "Hopsinkova 28",
        "your_street2": null,
        "your_city": "Praha",
        "your_zip": "10000",
        "your_country": "CZ",
        "your_registration_no": "87654321",
        "your_vat_no": "CZ1212121218",
        "your_local_vat_no": null,
        "client_name": "Apple Czech s.r.o.",
        "client_street": "Klimentská 1216/46",
        "client_street2": null,
        "client_city": "Praha",
        "client_zip": "11000",
        "client_country": "CZ",
        "client_registration_no": "28897501",
        "client_vat_no": "CZ28897501",
        "client_local_vat_no": null,
        "subject_id": 36,
        "subject_custom_id": null,
        "generator_id": null,
        "related_id": 1048,
        "correction": false,
        "correction_id": null,
        "paypal": false,
        "gopay": false,
        "token": "hTjIBHtUnw",
        "status": "paid",
        "order_number": "",
        "issued_on": "2018-03-21",
        "taxable_fulfillment_due": "2018-03-21",
        "due": 14,
        "due_on": "2018-04-04",
        "sent_at": null,
        "paid_at": "2018-03-21T00:00:00.000+01:00",
        "reminder_sent_at": null,
        "accepted_at": null,
        "cancelled_at": null,
        "webinvoice_seen_at": null,
        "note": "Fakturujeme Vám následující položky",
        "footer_note": "",
        "private_note": null,
        "tags": [],
        "bank_account": "1234/1234",
        "iban": null,
        "swift_bic": null,
        "payment_method": "bank",
        "currency": "CZK",
        "exchange_rate": "1.0",
        "language": "cz",
        "transferred_tax_liability": false,
        "eu_electronic_service": false,
        "vat_price_mode": "without_vat",
        "supply_code": "",
        "subtotal": "100.0",
        "total": "121.0",
        "native_subtotal": "100.0",
        "native_total": "121.0",
        "remaining_amount": "0.0",
        "remaining_native_amount": "0.0",
        "paid_amount": "0.0",
        "eet": false,
        "eet_cash_register": null,
        "eet_store": null,
        "eet_records": [],
        "lines": [
            {
                "id": 2559,
                "name": "Test",
                "quantity": "1.0",
                "unit_name": "",
                "unit_price": "100.0",
                "vat_rate": 21,
                "unit_price_without_vat": "100.0",
                "unit_price_with_vat": "121.0"
            }
        ],
        "html_url": "http://app.fakturoid.test/bigtest/invoices/1049",
        "public_html_url": "http://app.fakturoid.test/bigtest/p/hTjIBHtUnw/2018-1006",
        "url": "http://app.fakturoid.test/api/v2/accounts/bigtest/invoices/1049.json",
        "pdf_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/invoices/1049/download.pdf",
        "subject_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/subjects/36.json",
        "created_at": "2018-03-21T10:24:04.166+01:00",
        "updated_at": "2018-03-22T08:28:24.877+01:00"
    },
    {
        "id": 1045,
        "custom_id": null,
        "proforma": false,
        "partial_proforma": false,
        "number": "2018-1005",
        "variable_symbol": "120180003",
        "your_name": "Bořivoj Hejsek",
        "your_street": "Hopsinkova 28",
        "your_street2": null,
        "your_city": "Praha",
        "your_zip": "10000",
        "your_country": "CZ",
        "your_registration_no": "87654321",
        "your_vat_no": "CZ1212121218",
        "your_local_vat_no": null,
        "client_name": "Apple Czech s.r.o.",
        "client_street": "Klimentská 1216/46",
        "client_street2": null,
        "client_city": "Praha",
        "client_zip": "11000",
        "client_country": "CZ",
        "client_registration_no": "28897501",
        "client_vat_no": "CZ28897501",
        "client_local_vat_no": null,
        "subject_id": 36,
        "subject_custom_id": null,
        "generator_id": null,
        "related_id": 1044,
        "correction": false,
        "correction_id": null,
        "paypal": false,
        "gopay": false,
        "token": "xV6WDOQZfQ",
        "status": "paid",
        "order_number": "",
        "issued_on": "2018-03-21",
        "taxable_fulfillment_due": "2018-03-21",
        "due": 14,
        "due_on": "2018-04-04",
        "sent_at": null,
        "paid_at": "2018-03-21T00:00:00.000+01:00",
        "reminder_sent_at": null,
        "accepted_at": null,
        "cancelled_at": null,
        "webinvoice_seen_at": null,
        "note": "Fakturujeme Vám následující položky",
        "footer_note": "",
        "private_note": null,
        "tags": [],
        "bank_account": "1234/1234",
        "iban": null,
        "swift_bic": null,
        "payment_method": "bank",
        "currency": "CZK",
        "exchange_rate": "1.0",
        "language": "cz",
        "transferred_tax_liability": false,
        "eu_electronic_service": false,
        "vat_price_mode": "without_vat",
        "supply_code": "",
        "subtotal": "100.0",
        "total": "121.0",
        "native_subtotal": "100.0",
        "native_total": "121.0",
        "remaining_amount": "0.0",
        "remaining_native_amount": "0.0",
        "paid_amount": "0.0",
        "eet": false,
        "eet_cash_register": null,
        "eet_store": null,
        "eet_records": [],
        "lines": [
            {
                "id": 2555,
                "name": "Test",
                "quantity": "1.0",
                "unit_name": "",
                "unit_price": "100.0",
                "vat_rate": 21,
                "unit_price_without_vat": "100.0",
                "unit_price_with_vat": "121.0"
            }
        ],
        "html_url": "http://app.fakturoid.test/bigtest/invoices/1045",
        "public_html_url": "http://app.fakturoid.test/bigtest/p/xV6WDOQZfQ/2018-1005",
        "url": "http://app.fakturoid.test/api/v2/accounts/bigtest/invoices/1045.json",
        "pdf_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/invoices/1045/download.pdf",
        "subject_url": "http://app.fakturoid.test/api/v2/accounts/bigtest/subjects/36.json",
        "created_at": "2018-03-21T10:05:29.483+01:00",
        "updated_at": "2018-03-22T08:28:23.661+01:00"
    }
]
